In [2]:
from pandas import Series, DataFrame
import pandas as pd

### 从等长的字典创建

In [3]:
data = {'state':['ohio', 'ohio', 'ohio', 'nevada', 'nevada'],
        'year':[2000, 2001, 2002, 2001, 2002],
        'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)

In [4]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

#### 指定列顺序

In [5]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9

In [6]:
# columns 缺少时，会使用NaN代替
# 但是如果指定index，则必须要与实际行数相等
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN

### 获取列

In [7]:
frame.state

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
Name: state, dtype: object

In [8]:
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [9]:
frame[['year','pop']]

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9

### 获取行

In [10]:
frame.iloc[0]

state    ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [11]:
frame2.loc['one']

year     2000
state    ohio
pop       1.5
debt      NaN
Name: one, dtype: object

### 赋值

In [12]:
frame2.debt = 16.5
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5

In [13]:
import numpy as np

In [14]:
frame2.debt = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0

In [15]:
# 利用Series 赋值
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [16]:
# 使用不存在的列 会 创建列
frame2['test'] = val
frame2

       year   state  pop  debt  test
one    2000    ohio  1.5   0.0   NaN
two    2001    ohio  1.7   1.0  -1.2
three  2002    ohio  3.6   2.0   NaN
four   2001  nevada  2.4   3.0  -1.5
five   2002  nevada  2.9   4.0  -1.7

### 删除

In [17]:
del frame2['test']

In [18]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0

In [19]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

### 返回所有内部数据

In [20]:
frame2.values

array([[2000, 'ohio', 1.5, 0.0],
       [2001, 'ohio', 1.7, 1.0],
       [2002, 'ohio', 3.6, 2.0],
       [2001, 'nevada', 2.4, 3.0],
       [2002, 'nevada', 2.9, 4.0]], dtype=object)